+++
title = "Miscellaneous Exercises over the years"
tags = ["misc", "tools"]
toc = "true"
clocal = "true"
+++

* preamble                                                         :noexport:

#+PROPERTY: dest /Users/aayushbajaj/Documents/new-site/static/code/ccs/programming/languages/c/

#+begin_src emacs-lisp
(setq ndk/tangle-dir (org-entry-get nil "dest" t))

(defun ndk/org-babel-tangle-rename ()
  (let ((tangledir ndk/tangle-dir)
        (tanglefile (buffer-file-name)))
      (rename-file tanglefile tangledir t)))

(add-hook 'org-babel-post-tangle-hook #'ndk/org-babel-tangle-rename)
#+end_src

#+RESULTS:
| ndk/org-babel-tangle-rename |


